[
    {
      "task_number": "Task 1",
      "subtext": "Entrepreneurship facilities by govt",
      "description": "Study and spread awareness about the various Entrepreneurship related schemes and facilities provided by government (region / central) to help entrepreneurs.",
      "guidelines": "Visit government websites especially entrepreneurship ministry website.",
      "submission": "List of the facilities and schemes. Screenshot of the post on facebook, Instagram and LinkedIn page. Please ensure that the post reaches to a large number of people.",
      "points": 50,
      "deadline": "5th January 2020"
    },
    {
      "task_number": "Task 2",
      "subtext": "User's feedback",
      "description": "Meet people around you and ask them how adversely has a social problem affected them. Prepare a document taking views of all the people",
      "guidelines": "Make a Google Form and record responses from maximum students. You can extend this task into a social campaign of your ECell.",
      "submission": "Questions of Google form along with at least 30 responses.",
      "points": 50,
      "deadline": "5th January 2020"
    },
    {
      "task_number": "Task 3",
      "subtext": "Establishing society plan or calendar for the year.",
      "description": "As you establish Entrepreneurship Cell in your college, you should be very clear of the course of action for next one year which as a society you are going to implement. This includes the initiatives which your society: Ecell is going to take to promote entrepreneurship amongst youth, events, competitions, workshops/activities which you will be conducting to provide opportunities in the field of entrepreneurship.",
      "guidelines": "Prepare a timeline for the year including description and overview of all the events which you are planning as a society to conduct in order to establish entrepreneurial environment in your college and influence people from other colleges as well.",
      "submission": "Document.",
      "points": 50,
      "deadline": "5th January 2020"
    },
    {
      "task_number": "Task 4",
      "subtext": "SOCH",
      "description": "SOCH is abbreviated for Social Change. It is a social entrepreneurship challenge aimed at eradication of social evils by innovative solutions. Social entrepreneurship is an approach by  entrepreneurs, in which they develop, fund and implement solutions to social, cultural, or environmental issues. Its main aim is to help in finding out creative solutions to the common social problems.",
      "guidelines": "Only one team can register from a particular college. The venture/idea should be solving the issues pertaining to problems of India. The idea should be submitted in a document form stating the social impact their venture would create and how it is different from an already existing venture for the chosen social issue, if there exists one.",
      "submission": "Document.",
      "points": 50,
      "deadline": "5th January 2020"
    },
    {
      "task_number": "Task 5",
      "subtext": "Markbiz",
      "description": "There will be a basic quiz conducted by E-cell, NSUT. It will be focusing on the knowledge of participants about marketing, branding and disruptions in the domain of marketing. The quiz will question the basics of marketing strategy adopted by the start-ups.",
      "guidelines": "A questionnaire will be given. Download the document, edit your responses in the given template and upload it in submissions.",
      "submission": "Document.",
      "points": 50,
      "deadline": "5th January 2020"
    },
    {
      "task_number": "Task 6",
      "subtext": "Aware your college students about startup culture via social media",
      "description": "Having not only an online presence but good social media reach is must for E-Cells needs to publicize itself. This will give you a platform for promoting events conducted by you. Make Facebook page,Instagram and LinkedIn account for your E-Cell.",
      "guidelines": "Set Up a Facebook page,Instagram and LinkedIn account for your E-cell. Increase your social media presence and post about startups, latest events you participated in or happening in the entrepreneurial sector, posts about famous entrepreneurs. You can have a look at our various social handles of E Cell NSIT",
      "submission": "Paste the link of the accounts into a document along with screenshot of the latest post.",
      "points": 50,
      "deadline": "5th January 2020"
    },
    {
      "task_number": "Task 7",
      "subtext": "",
      "description": "E-sell is a marketing competition. It is aimed at devising a new marketing strategy and tagline for an already existing product. Effective marketing starts with a considered, well-informed marketing strategy. A good marketing strategy helps you define your vision, mission and business goals, and outlines the steps you need to take to achieve these goals.",
      "guidelines": "Devise a totally reformed marketing strategy for an already existing product in the market in a document form which should describe your business and its products and services. It should also include the marketing tactics you will bring into use that wasn’t used as a part of marketing strategy of the chosen product. Provide a different and unique tagline for the product that describes the marketing strategy and product’s purpose in the most efficient way.",
      "submission": "Powerpoint Presentation.",
      "points": 50,
      "deadline": "5th January 2020"
    },
    {
      "task_number": "Task 8",
      "subtext": "Conduct Group Discussions regarding various situations on our Title Sponsor.",
      "description": "A group discussion in your college.",
      "guidelines": "A proper set of problem should be solved in various group discussion and proper conclusion should be provided to a given set of problems ,you will be provided with a list of problems out of which u have to conduct Group discussion on 3 of them.",
      "submission": "A document with detailed analysis of the Group discussion along with list of students participating and moderating int GD and a 15 min video of the GD.",
      "points": 50,
      "deadline": "5th January 2020"
    },
    {
      "task_number": "Task 9",
      "subtext": "Conduct a workshop on Case study techniques or a competition.",
      "description": "Case study competition in your college.",
      "guidelines": "Conduct a case study competition in your college. Invite a judge to your college for the finals.",
      "submission": "Document containing Case study, list of participating students and winners along with their submission in powerpoint. 5 Photograph of participants along with DEC poster. 3 videos of 10 sec of students final presentation.",
      "points": 50,
      "deadline": "5th January 2020"
    },
    {
      "task_number": "Task 10",
      "subtext": "Make a visit to a Start-up office.",
      "description": "Visit to an active startup to get to know what problem they are solving and how do they aim to solve it . Take a look into their day to day activities and see how they set up their goals for the day.",
      "guidelines": "Contact a Startup and make an official visit of E-cell members.",
      "submission": "7 Photograph of the visit, some along with DEC posters.",
      "points": 50,
      "deadline": "5th January 2020"
    }
  ]
  