[
  {
    "task_number": "Task 1",
    "subtext": "Entrepreneurship facilities by govt",
    "description": "Study and spread awareness about the various Entrepreneurship related schemes and facilities provided by government (region / central) to help entrepreneurs.",
    "guidelines": "Visit government websites especially entrepreneurship ministry website.",
    "submission": "List of the facilities and schemes. Screenshot of the post on facebook, Instagram and LinkedIn page. Please ensure that the post reaches to a large number of people.",
    "points": 50,
    "deadline": "5th January 2020"
  },
  {
    "task_number": "Task 2",
    "subtext": "User's feedback",
    "description": "Meet people around you and ask them how adversely has a social problem affected them. Prepare a document taking views of all the people",
    "guidelines": "Make a Google Form and record responses from maximum students. You can extend this task into a social campaign of your ECell.",
    "submission": "Questions of Google form along with at least 30 responses.",
    "points": 50,
    "deadline": "5th January 2020"
  },
  {
    "task_number": "Task 3",
    "subtext": "Establishing society plan or calendar for the year.",
    "description": "As you establish Entrepreneurship Cell in your college, you should be very clear of the course of action for next one year which as a society you are going to implement. This includes the initiatives which your society: Ecell is going to take to promote entrepreneurship amongst youth, events, competitions, workshops/activities which you will be conducting to provide opportunities in the field of entrepreneurship.",
    "guidelines": "Prepare a timeline for the year including description and overview of all the events which you are planning as a society to conduct in order to establish entrepreneurial environment in your college and influence people from other colleges as well.",
    "submission": "Document.",
    "points": 50,
    "deadline": "5th January 2020"
  },
  {
    "task_number": "Task 4",
    "subtext": "SOCH",
    "description": "SOCH is abbreviated for Social Change. It is a social entrepreneurship challenge aimed at eradication of social evils by innovative solutions. Social entrepreneurship is an approach by  entrepreneurs, in which they develop, fund and implement solutions to social, cultural, or environmental issues. Its main aim is to help in finding out creative solutions to the common social problems.",
    "guidelines": "Only one team can register from a particular college. The venture/idea should be solving the issues pertaining to problems of India. The idea should be submitted in a document form stating the social impact their venture would create and how it is different from an already existing venture for the chosen social issue, if there exists one.",
    "submission": "Document.",
    "points": 50,
    "deadline": "5th January 2020"
  }
]
